configuration/rust/load_test_rust_read.yml
config:
  target: "http://127.0.0.1:8017"
  plugins:
    # expect: {}  
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load    
    - duration: 120
      arrivalRate: 50
      name: Sustained load
 
scenarios:         
  - name: "Rust | Retrieving, storing data and retrieving"
    flow:
    - get:
        url: "/num-comp-ram"